
## Plan Result (aws/eks)

[CI link](https://github.com/44smkn/terraform/actions/runs/1975970538)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecr_repository.karpenter


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecr_repository.karpenter will be created
  + resource "aws_ecr_repository" "karpenter" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "karpenter"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.module.eks.aws_security_group.cluster[0] has changed
  ~ resource "aws_security_group" "cluster" {
        id                     = "sg-06cfef42c62f8d679"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Karpenter readiness"
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-030c31b3f618a340d",
                ]
              + self             = false
              + to_port          = 8443
            },
            # (1 unchanged element hidden)
        ]
        name                   = "44smkn-test-cluster-20220312165226469300000004"
        tags                   = {
            "Name"                               = "44smkn-test-cluster"
            "karpenter.sh/discovery/44smkn-test" = "1"
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group.node[0] has changed
  ~ resource "aws_security_group" "node" {
        id                     = "sg-030c31b3f618a340d"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Cluster API to AWS LB Controller webhook"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = [
                  + "sg-06cfef42c62f8d679",
                ]
              + self             = false
              + to_port          = 0
            },
            # (5 unchanged elements hidden)
        ]
        name                   = "44smkn-test-node-20220312165226469900000005"
        tags                   = {
            "Name"                               = "44smkn-test-node"
            "karpenter.sh/discovery/44smkn-test" = "1"
            "kubernetes.io/cluster/44smkn-test"  = "owned"
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_karpenter_ports_tcp"] has changed
  ~ resource "aws_security_group_rule" "cluster" {
      + cidr_blocks              = []
        id                       = "sgrule-2760560242"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["aws_lb_controller_webhook"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
      ~ from_port                = 9443 -> 0
        id                       = "sgrule-1250358127"
      + ipv6_cidr_blocks         = []
      ~ to_port                  = 9443 -> 0
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":43,"Program":"tfcmt","SHA1":"d98628c6cf9a30c33437ae18777076a9992c1bd4","Target":"aws/eks","Vars":{},"WorkflowName":"test"} -->